#define __main_c
#include "includeAll.h"

//===============================main主函数====================================
void main() {

		SysInit();				//芯片系统初始化
		VarsInit();
		F_turnOnWDT();    //使能看门狗

		/***实现LED灯点亮***/
		//同时点亮LED1和LED2
		LED1_and_LED2();
	
		//点亮LED1
		//LED1_ON();
		
		//点亮LED2
		//LED2_ON();
	
		/***实现控制蜂鸣器***/	
		while(1){	
			/***不足：声音频率的调节还不是很好***/
			Buzz_On();
		}

		while (1) {		
			F_clearWDT();	  //喂狗

			TimeProcess();
			TaskSetting();
			TaskProcess();
			//DisplayProcess();	
		}
}
//=============================================================================

//===========================定义时间处理函数==================================
//控制时钟
void TimeProcess() {

static uint8_t timer5ms = 0;

  if (b1ms) {
    // 1ms 执行一次
    b1ms = 0;
    timer5ms++;
  }
  if (timer5ms >= 5) {
		P1MODL = 0xa8;
    	GetKeys();
  }
}
//=============================================================================

//=============================================================================
void TaskProcess() {}
//=============================================================================
	
//=============================定义任务建立函数================================
//===================任务：实现单端口复用进行按键控制led亮灭=================//
void TaskSetting() {

	if (ledcom_State){
		//LED状态转换
		if(D_keyValue1 == keyValue){
			ledcom_State = ~ledcom_State;		
		}
		P1MODL = 0xaa;
	}
	else {
			if(D_keyValue1 == keyValue){
				ledcom_State = ~ledcom_State;	
			}
	}
}
//=============================================================================

//=============================================================================
void DisplayProcess() {}
//=============================================================================

//===============================定义延时函数==================================
void Delay(uint16_t time) {
     uint16_t i, j;
     for (i = 0; i < time; i++) {
           for (j = 0; j < 1000; j++) {
              /* code */
             F_clearWDT();
           }
     }
}
//=============================================================================
